"""
3. Задание на закрепление знаний по модулю yaml.
 Написать скрипт, автоматизирующий сохранение данных
 в файле YAML-формата.
Для этого:

Подготовить данные для записи в виде словаря, в котором
первому ключу соответствует список, второму — целое число,
третьему — вложенный словарь, где значение каждого ключа —
это целое число с юникод-символом, отсутствующим в кодировке
ASCII(например, €);

Реализовать сохранение данных в файл формата YAML — например,
в файл file.yaml. При этом обеспечить стилизацию файла с помощью
параметра default_flow_style, а также установить возможность работы
с юникодом: allow_unicode = True;

Реализовать считывание данных из созданного файла и проверить,
совпадают ли они с исходными.
"""


'''Задание на закрепление знаний по модулю json. Есть файл orders в формате 
JSON с информацией о заказах. Написать скрипт, автоматизирующий его 
заполнение данными. Для этого: Создать функцию write_order_to_json(), 
в которую передается 5 параметров — товар (item), количество (quantity), 
цена (price), покупатель (buyer), дата (date). Функция должна 
предусматривать запись данных в виде словаря в файл orders.json. При записи 
данных указать величину отступа в 4 пробельных символа; Проверить работу 
программы через вызов функции write_order_to_json() с передачей в нее 
значений каждого параметра. """

3 tasl

Задание на закрепление знаний по модулю yaml. Написать скрипт, 
автоматизирующий сохранение данных в файле YAML-формата. Для этого: 
Подготовить данные для записи в виде словаря, в котором первому ключу 
соответствует список, второму — целое число, третьему — вложенный словарь, 
где значение каждого ключа — это целое число с юникод-символом, 
отсутствующим в кодировке ASCII (например, €); Реализовать сохранение данных 
в файл формата YAML — например, в файл file.yaml. При этом обеспечить 
стилизацию файла с помощью параметра default_flow_style, а также установить 
возможность работы с юникодом: allow_unicode = True; Реализовать считывание 
данных из созданного файла и проверить, совпадают ли они с исходными. 
'''

hm









